{
    "role": "Machine Learning engineer - Habilidades - Experiência em plataformas de IA: proficiência em Azure ML, incluindo integração com pipelines de aprendizado de máquina e automação de fluxo de trabalho Experiência em Deep Learning: Conhecimento avançado de estruturas de deep learning (TensorFlow, PyTorch, Keras, YOLO, DetectNet, MobileNet, TensorFlow Lite). Proficiência em Visão Computacional: Experiência comprovada com soluções de IA em visão computacional, utilizando técnicas modernas de aprendizagem profunda e clássicas (SIFT, SURF, HOG). Construção de pipeline de ML: capacidade de construir pipelines de ML robustos que abrangem todos os estágios, desde o pré-processamento até a implantação e o monitoramento.Conhecimento de IA generativa: compreensão de técnicas de IA generativa, incorporações, modelos RAG com LangChain e ajuste fino de modelo.Desenvolvimento de Soluções Escaláveis: Experiência na criação de modelos escaláveis para ambientes de computação em nuvem e edge.Familiaridade com ferramentas de desenvolvimento: Conhecimento de conteinerização (Docker, Kubernetes) e ferramentas CI/CD para automação de implantação. Habilidades interpessoais - Adaptabilidade: Flexível e rápido para aprender novas tecnologias e metodologias à medida que os projetos evoluem. Capacidade de resolução de problemas: Hábil em abordar problemas complexos estruturalmente, empregando pensamento analítico e criativo.Trabalho em equipe: Colaboração eficaz com equipes multidisciplinares, promovendo um ambiente de trabalho cooperativo.Habilidades de Comunicação: Capacidade de articular soluções técnicas claramente para públicos técnicos e não técnicos.Gerenciamento de Tempo: Competente no gerenciamento de prazos de projetos e na priorização de tarefas em ambientes de alta pressão.Principais responsabilidades:Experiência em plataforma de IA: aproveite a proficiência em Azure ML para integrar pipelines de aprendizado de máquina e automatizar fluxos de trabalho.Estruturas de aprendizagem profunda: utilize conhecimento avançado de estruturas como TensorFlow, PyTorch, Keras, YOLO, DetectNet, MobileNet e TensorFlow Lite para desenvolver modelos complexos de IA.Soluções de visão computacional: implemente soluções de IA em visão computacional usando técnicas modernas de aprendizagem profunda e abordagens clássicas (por exemplo, SIFT, SURF, HOG). Atuar em projetos envolvendo processamento de imagens, detecção e classificação de objetos.Pipelines de aprendizado de máquina: crie pipelines de ML robustos e sofisticados, incluindo pré-processamento de dados, treinamento, validação, implantação e monitoramento em ambientes de produção.Técnicas de IA generativa: Aplicar conhecimento de técnicas de IA generativa, como embeddings, modelos de geração aumentada de recuperação (RAG) com LangChain e ajuste fino de modelos.Desenvolvimento de modelos escaláveis: Desenvolva soluções escaláveis com foco em implantações em nuvem (Azure, AWS) e sistemas de computação de ponta para aplicações de visão computacional.Ferramentas de desenvolvimento: utilize tecnologias de conteinerização como Docker e Kubernetes e empregue ferramentas de CI/CD para implantações automatizadas.Colaboração multifuncional: trabalhe de forma eficaz com equipes multidisciplinares, incluindo engenheiros de software, cientistas de dados e partes interessadas de negócios, para fornecer soluções integradas.Resolução de problemas: Aborde desafios complexos de maneira estruturada, combinando pensamento analítico e criativo para desenvolver soluções eficazes.Comunicação: Explique claramente as soluções técnicas às equipes técnicas e aos clientes, garantindo o alinhamento e o entendimento entre todas as partes interessadas.Experiência desejada:Participação em projetos envolvendo IA aplicada à visão computacional em setores como manufatura, segurança ou marketing digital.Contribuição para modelos de aprendizado de máquina ponta a ponta, desde a coleta de dados até a implantação de soluções de produção.Implementação de soluções de Retrieval Augmented Generation (RAG) em bases de dados textuais e visuais, integradas em aplicações interactivas.",
    "cv": "CIENTISTA DE DADOS Sou um profissional orientado a dados, sempre buscando me aprofundar na área e aplicar machine learning para resolver problemas de negócio. Atualmente atuando como Cientista de Dados Jr, estou empenhado em desenvolver minhas habilidades e crescer na área de machine learning. Valorizo o trabalho em equipe e estou comprometido em oferecer serviços de qualidade. EDUCAÇÃO Faculdade Anhanguera Comércio Exterior | jul/2022 - dez/2024 Ada Tech Santander Coders 2024 | Triha: Ciência de Dados jul/2024 - dez/2024 Faculdade Metropolitana Pós-graduação Lato Sensu | Engenharia de Software jan/2025 - dez/2025 LÍNGUAS Português (nativa) Inglês (avançado) PROJETOS Aprovação de crédito com algoritmo de classificação: Melhores práticas em ciência de dados e MLOps hhttps://github.com/ju4nv1e1r4/credit-approval Este projeto tem como objetivo desenvolver um sistema preditivo para auxiliar na avaliação de crédito. Utilizando algoritmos de Machine Learning, com o objetivo de construir um modelo de classificação para determinar a aprovação ou não de crédito para clientes específicos. Esse projeto pode ajudar a tomar decisões mais rápidas e assertivas, reduzindo o risco de inadimplência e otimizando a alocação de crédito. Gerenciamento do ciclo de vida de modelos de aprendizado de máquina com o MLflow https://github.com/ju4nv1e1r4/mlflow-2024 Projeto específico para demonstração de uso do MLflow como ferramenta em projetos de Machine Learning. Neste projetos iremos abordar um dataset com preços de casas, modelo de predição, além de algumas práticas de CD4ML e MLOps, mas com foco no MLflow. Também fiz o uso de kubernetes para deployment do projeto. Lung Cancer Predict https://github.com/ju4nv1e1r4/lung_cancer_predict Este projeto trata do desenvolvimento de um modelo de aprendizado de máquina que usa um algoritmo de classificação para prever o câncer de pulmão. Este projeto está em andamento. Usei o MLflow para gerenciar o ciclo de vida dos modelos, usei pytest para criar testes unitários, testes de dados, testes de pré-processamento, mocks, testes de modelos e suas respectivas métricas, e demais testes lógicos. Aplicarei MLOps do começo ao fim deste projeto. HARD SKILLS SQL, T-SQL, PL/SQL, NoSQL, SQLite Python, Go Data: Pandas, Numpy Big data: Pyspark DataViz: Power BI, Looker Studio GCP (Google Cloud Platform): Big Query ML, Dataprep, Dataproc, Dataflow, Vertex AI (workbench, colab enterprise, model garden, Vertex AI Studio, AutoML, Natural Language API, Speech-to-Text API), gcloud CLI, Cloud run, App Engine, Compute Engine, Cloud Storage, GKE. AWS (Amazon Web Services) Azure (Microsoft) Git/Github MLOps: MLflow, Pytest, Structlog, Docker, Kubernetes, Github Actions, Flask Machine Learning: Scikit-Learn, Pycaret, Imblearn Deep Learning: Keras, TensorFlow, Sequential, Functional, Subclassing, Tensorboard, Backpropagation, MLPs, GDs NLP: NLTK, Spacy, Fuzzy Wuzzy LLM: RAG, Prompt Engineering, Langchain, CrewAI SOFT SKILLS Capacidade analítica Resolução de problemas Comunicação Curiosidade Trabalho em equipe Pensamento crítico Atenção aos detalhes Aprendizagem rápida Gestão do tempo Criatividade Estatística Matemática aplicada Autodidatismo Autoaperfeiçoamento Metodologias Ágeis EXPERIÊNCIAS Data Scientist I Macfor Full Marketing Digital | ago/2024 - atual Responsável por contribuir com a inovação e desenvolvimento de soluções em IA; Apoiar no desenvolvimento e implementação de modelos de IA e machine learning usando frameworks como TensorFlow, PyTorch e Sciki- learn; Colaborar com a equipe de desenvolvimento em projetos de análise de dados; Auxiliar na criação de algoritmos que melhorem os processos de marketing digital; Participar de reuniões e contribuir com ideias; Realizar pesquisas e testes para otimizar a performance dos modelos de IA e Machine Learning; Coletar informações e levantamento de requisitos para desenvolvimento de sistemas de Machine Learning e AI; Testes em sistemas de ML/AI utilizando Docker; Deploy e Monitoramento de aplicações e sistemas de ML/AI no Google Cloud Platform (Cloud Run, App Engine, Vertex AI). Data Consultant - Freelancer Vocaiza Digital | jul/2024 - ago/2024 Requisição/coleta de dados via API REST da Yampi (dooki), tratamento dos dados e transformação para um formato tabular, carga em em bucket na AWS (utilizando instância EC2) e automação do processo de (ETL) usando schedule, (execução do processo usando python). Business Analyst SouJunior Labs | Voluntário | mai/2024 - atual No projeto SoliciteMe fiquei encarregado das atividades de Business Analyst, responsável pela pesquisa, coleta e interpretação de dados para melhorar os processos do projeto e o negócio em si."
}